dnxo1224/ESP-C6-realtime-analyzer/firmware/csi_send/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
# WIRELESS-BACKHAUL 게이트웨이(Tx+수집기) 구성.
# sdkconfig를 지우고 다시 빌드하면 이 파일에서 재생성된다.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_PARTITION_TABLE_OFFSET=0xa000
# 바이너리 프레임을 USB-Serial/JTAG로 내보내므로 콘솔은 USJ 단독이어야 한다.
# (UART 콘솔 + secondary USB 구성이면 ROM putc 로그가 드라이버 프레임 사이에 끼어 오염됨)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=128
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=128
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
# 프로브 주기 고정(vTaskDelayUntil)과 통계 타이밍에 1ms 틱 사용.
CONFIG_FREERTOS_HZ=1000
